app/views/movies/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
                                         <% sum = 0 %> <% cnt = 0 %>
                                         <% movie.reviews.each do |review| %>