app/views/movies/show.html.erb

  <% sum = 0 %> <% cnt = 0 %>
  <% @movie.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]