app/controllers/movies_controller.rb

  def index
    @movies = Movie.all
    @reviews = Review.all
---
SELECT "movies".* FROM "movies"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "poster", "genre", "runningtime", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "pirates of caribbean 5"], ["updated_at", "2017-06-09 10:21:46.495158"], ["id", 3]]