app/controllers/reviews_controller.rb

    def create
        #render plain: params
        @movie = Movie.find(params[:movie_id])
        @review = @movie.reviews.create(review_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("reviewer", "body", "score", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["reviewer", "hello"], ["body", "man"], ["score", 10], ["movie_id", 2], ["created_at", "2017-06-08 19:36:31.040538"], ["updated_at", "2017-06-08 19:36:31.040538"]]

    def destroy
        @movie = Movie.find(params[:movie_id])
        @review = @movie.reviews.find(params[:id])
        @review.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT ?  [["movie_id", 1], ["id", 4], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 4]]