app/views/reviews/_form.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 2]]
---
<%= form_for([@movie, @movie.reviews.build]) do |form| %>
<% if @movie.reviews.build.errors.any? %>